[
  {
    "id": 1478,
    "display_name": "Sara C",
    "pin": 4440,
    "photo": "https://www.psychicsofa.com/Images/Readers/OL9y1422359756-120-120.jpg",
    "status": "Busy",
    "favourite_story": "",
    "favourite_story_approved": 0,
    "callendtime": "0000-00-00 00:00:00",
    "description": "Tarot cards, life coach and my very strong intuitive ability.",
    "personal_story": "I have been reading the tarot cards for over 15 years now and they always give me accurate and beneficial messages. Over the years i have developed my tarot reading skills by reading them intuitively which can give even more insight into a situation. Over the years i have developed my psychic ability and become more spiritually aware.\r\nI can always offer you reassuring, calming and intuitive guidance, and you will be a lot wiser to the situation. I have been through  many ups and downs in my life and i can relate to your  matters, so nothing will phase me..\r\nI offer you my warmest welcome and look forward to hearing from you all.\r\n ",
    "question1": "The tarot cards are here to give you guidance and knowing that i can help in some way gives me great satisfaction.\r\nI always offer calm and light guidance and you will feel refreshed and positive about your situation.\r\nYou will see some light at the end of the tunnel.",
    "question2": " I am a very typical Arian women, very headstrong, ambitious, honest  and full of life.\r\nEveryday is a new and positive for me  and i embrace new challenges that come my way.\r\n \r\n \r\n ",
    "question3": "Since my early 20's i knew i had some strong psychic ability but i only looked in to this as i got older. I started to become interested in the tarot cards and spiritual world as i was just fascinated by it all. My interest is always growing as there are so many areas to develop in.\r\nI had spirits visit me in my dreams many years ago and often couldn't understand why. I now know why as i have realised my true calling was to give insight and guidance to people from all walks of life. The past now makes much more sense, and i believe everything happens for a reason.\r\nAlso being told by many credible mediums/psychics that i should be reading for clients also helped me go forward in this area.\r\n \r\n ",
    "question4": "All my client readings are private and all are memorable to me only.",
    "question5": "I am also a life coach and i can give you support and meditation suggestions to get clients  through some challenging  times.\r\nMy mentors are spiritually gifted and help me grow and develop in this area throughout the year. ",
    "question6": "To have an open mind  relax and to remain positive. If you are open to having a reading then it is beneficial to stay focused and calm.\r\nA few deep breaths can help and also a clear mind, this way you will receive the guidance needed to help you further.\r\nThanks for reading my profile and i look forward to hearing from you. x\r\n "
  },
  {
    "id": 1527,
    "display_name": "Lorna Max",
    "pin": 4726,
    "photo": "https://www.psychicsofa.com/Images/Readers/gZrr1518788259-120-120.jpg",
    "status": "Available",
    "favourite_story": "",
    "favourite_story_approved": 0,
    "callendtime": "2018-10-15 15:30:00",
    "description": "Psychic Clairvoyant - Medium - Shaman - Energy/Voice Vibration - Tarot/Oracle Cards - Animal Guides/Medicine",
    "personal_story": "Hi there, I am a fifth generation psychic, medium and clairvoyant.   I work with voice vibration and tuning into energy as well as working with other tools if I do need them.  I absolutely love working with spirit and my guides with a passion.   I connect very strongly with animals during readings which bring through great meanings and medicine.  I am a very down to earth reader and my objective is to send you my caller away ready to cope with what you need to, giving you options and explanations to blockages or obstacles in your life.  For me its about getting your guides and my guides together and making some progress. My main guide \"White Feather\" is very stern but we make a good team and we do our best to help where we can. ",
    "question1": "I love the buzz and I love people and I love to help.   I find my job very very rewarding.   A smile or a tear on a clients face when a reading all falls into place, its priceless.",
    "question2": "Being an Aries I do have the typical traits of impatience of the Ram and a bubbly personality but with my ascendant in Scorpio and my sun in Aquarius it does give me a bit of a mix and I would not say I am a typical Aries.",
    "question3": "I had a near death experience when I was 29 and I was made to awaken.  I was born into a family where the females read tea leaves but I never had it forced upon me and I was left to find my own way.  I wasn't listening so I was made to listen.  I now understand my childhood better as I seen and heard a lot of things so I know I have been like this from a very young age.  My great granny is my family guide around me daily to help me with readings, I don't read tea leaves like she did but she does guide me in other ways. ",
    "question4": "After reading now for over 15 years it is hard to pick one particular experience but I do feel it may be the day I seen my friend's husband's grandad in the crystal ball.  It brought a lot of comfort to him and it kind of made me understand what I am on earth plain for.",
    "question5": "Life experience is high up there, as I have had many obstacles in my own life.   I have also done counselling and NLP courses, psychotherapy and hypnotherapy and these qualifications all help me as a reader.      My first love is Reiki and I started my whole journey with Reiki, now a Usui Master and Grand Master. This does help me with the energy side of readings.   I pick up on the energy of a client and the colours I can see can help with healing or to identify blockages in chakras.   I have done courses within the Shamanic realm and this is where my connection grew stronger with spirit animals. I also have a diploma in past lives and this can help when we have relationship issues which may actually go back to previous life connections.",
    "question6": "I have had many a reading myself and for me I am very much drawn to a face so if you are drawn to a particular reader then the chances are you will get a good connection between you.   I always ask clients to come with an open mind and be relaxed before you pick up the phone and ready with questions as a reading can go so very quickly, so make the most of it.   I am a very straight to the point reader and I will not give you \"fluffy stuff\", please be aware of this before you call.   Also as a practising medium of many years I cannot guarantee who you want to come through will actually make an appearance, so an open mind is very much required.  Most of all relax and enjoy and be aware if you do not like anything you hear you have the \"free will\" to make those changes, not everything is written in stone."
  },
  {
    "id": 1553,
    "display_name": "Anthony",
    "pin": 4629,
    "photo": "https://www.psychicsofa.com/Images/Readers/6mHz1428913538-120-120.jpg",
    "status": "Busy",
    "favourite_story": "",
    "favourite_story_approved": 0,
    "callendtime": "0000-00-00 00:00:00",
    "description": "Psychic - Tarot - Spiritualist Medium - Crystal ball - Water and Wax stick readings",
    "personal_story": "Hi I’m Anthony, I’m a spiritualist and third generation medium. I’m also a psychic, tarot reader, pendulum dowser, crystal ball/water and wax reader and also take stick readings (for anyone unsure of what that is, someone gives me a stick and i give them a reading from it, you would be surprised how accurate the readings are!). I love to explore different ways of divination and scrying and I am fascinated by the history and philosophy of spiritualism and divination. In my spare time I spend time with my wife and (small) child, love researching my family tree, enjoy cooking - especially new dishes, enjoy trips away and I am slowly writing a novel. ",
    "question1": "Years before I ever started to give readings I was told that part of the reason I am here is to give advice and to help others. When I am giving guidance I feel at one with myself, with spirit and, sometimes, with the questioner. It can be an amazing feeling, the connection with spirit. A healers job is to be a channel, or medium, for spirit, whereas a mediums job is to be a healer, to heal through the messages they give. To give advice to people at a low ebb, to help illuminate a direction for them and give advice without judgment is the most important thing about what I do.\r\nRecently I was on platform in a local hall with a psychic. With the first message I gave spirit shone love on them, through me, and that love was so strong it was the main thing I felt for the next three and a half hours until the end of the evening. Readings can be amazing, the messages you give, stories you hear and feelings you encounter.",
    "question2": "In some ways I am a typical Aries; I’m positive, passionate, stubborn and impulsive. I’m also very loyal and enjoy new experiences. I often come across as confident, strong willed and enjoy meeting new people. I do believe in star signs, although not the general readings in the paper. I have had a personal reading from a very well known astrologer - and he was spot on with almost everything.  ",
    "question3": "I have been aware of having spirit around me since I was a toddler. When I started playgroup I had to be taken home as I hid under the table, refusing to come out, complaining that there were ‘too many dead people in the room’. I am strongly clairsentient, as a child my parents had paintings of my (long deceased) grandparents on the wall and I could feel both of them in the room, I was able to say where they were, how tall they were, what they were wearing, how they felt etc. I also have a strong psychic link with family and friends. In my early teens I had readings from two Tarot readers who both told me that I had ‘the gift’. My Mum bought a set of Tarot cards and a book to teach herself how to read, she would lay the cards out in her spread, open her book in readiness - and I would annoy her by turning the cards over and quickly, card by card, announcing what each card meant and giving the other person a potted, on the spot reading from what I felt the cards were saying to me....she would then turn them back over and start her reading. Twenty minutes, and much page turning, later she would finish....and her reading would be the same as mine.",
    "question4": "There are several. As a medium I have had people who have committed suicide come through, as well as murder victims. I remember being on platform once and telling someone that they had just been through a heart wrenching split which they \r\nwere slowly adjusting to. She started to cry. I remember reassuring her and telling her that she was, step by step, going to find balance in her life and move on. I also realised that it was a last minute decision to be there that night but she felt she needed guidance. I told her that her mothers mother was with her, she should feel her presence right behind her. She was giving her a red rose. At the end of the message she asked if I could tell her any more about the messenger. There wasn’t much I could tell her, I felt her grandmother saying not to mind her, it was the message that was important, all I could say was that she was dressed all in blue. She confirmed the message, including parts I haven’t mentioned here, before telling me that she often felt her grandmother behind her and that she was a no nonsense, down to earth person who was buried in a blue dress with a red rose.\r\n \r\n ",
    "question5": "I have a great deal of life experience. I spent 10 years traveling and performing as an actor before training to be a teacher. I understand how to give a reading to someone, the sensitivity that’s needed in order to make the reading a positive experience. I have also worked in care, a very humbling experience. As well as dealing with doctors, emergency services, psychiatrists and other professionals caring for those who were dying, and their grieving relatives, taught me a lot about empathy, sympathy and something about the nature of life.",
    "question6": "All I ask of anyone is to be open to the experience and remember not to give too much information away, it’s my job to give you a reading, not for you to tell me all about your self and your troubles! Remember, I will not tell you anything 'nasty' - about deaths etc - and I am not here to be a 'fortune helper'- I will not tell you whether you will have a baby or win the lottery or which horse to back. I will tell you about yourself, your situation and give you an honest reading. Another thing to remember is to relax, enjoy the experience and I hope you will take something away with you.\r\n "
  }
]
