[
  {
    "id": 1478,
    "display_name": "Sara C",
    "pin": 4440,
    "photo": "https://www.psychicsofa.com/Images/Readers/OL9y1422359756-120-120.jpg",
    "status": "Busy",
    "favourite_story": "",
    "favourite_story_approved": 0,
    "callendtime": "0000-00-00 00:00:00",
    "description": "Tarot cards, life coach and my very strong intuitive ability.",
    "personal_story": "I have been reading the tarot cards for over 15 years now and they always give me accurate and beneficial messages. Over the years i have developed my tarot reading skills by reading them intuitively which can give even more insight into a situation. Over the years i have developed my psychic ability and become more spiritually aware.\r\nI can always offer you reassuring, calming and intuitive guidance, and you will be a lot wiser to the situation. I have been through  many ups and downs in my life and i can relate to your  matters, so nothing will phase me..\r\nI offer you my warmest welcome and look forward to hearing from you all.\r\n ",
    "question1": "The tarot cards are here to give you guidance and knowing that i can help in some way gives me great satisfaction.\r\nI always offer calm and light guidance and you will feel refreshed and positive about your situation.\r\nYou will see some light at the end of the tunnel.",
    "question2": " I am a very typical Arian women, very headstrong, ambitious, honest  and full of life.\r\nEveryday is a new and positive for me  and i embrace new challenges that come my way.\r\n \r\n \r\n ",
    "question3": "Since my early 20's i knew i had some strong psychic ability but i only looked in to this as i got older. I started to become interested in the tarot cards and spiritual world as i was just fascinated by it all. My interest is always growing as there are so many areas to develop in.\r\nI had spirits visit me in my dreams many years ago and often couldn't understand why. I now know why as i have realised my true calling was to give insight and guidance to people from all walks of life. The past now makes much more sense, and i believe everything happens for a reason.\r\nAlso being told by many credible mediums/psychics that i should be reading for clients also helped me go forward in this area.\r\n \r\n ",
    "question4": "All my client readings are private and all are memorable to me only.",
    "question5": "I am also a life coach and i can give you support and meditation suggestions to get clients  through some challenging  times.\r\nMy mentors are spiritually gifted and help me grow and develop in this area throughout the year. ",
    "question6": "To have an open mind  relax and to remain positive. If you are open to having a reading then it is beneficial to stay focused and calm.\r\nA few deep breaths can help and also a clear mind, this way you will receive the guidance needed to help you further.\r\nThanks for reading my profile and i look forward to hearing from you. x\r\n "
  },
  {
    "id": 1527,
    "display_name": "Lorna Max",
    "pin": 4726,
    "photo": "https://www.psychicsofa.com/Images/Readers/gZrr1518788259-120-120.jpg",
    "status": "Available",
    "favourite_story": "",
    "favourite_story_approved": 0,
    "callendtime": "2018-10-15 15:30:00",
    "description": "Psychic Clairvoyant - Medium - Shaman - Energy/Voice Vibration - Tarot/Oracle Cards - Animal Guides/Medicine",
    "personal_story": "Hi there, I am a fifth generation psychic, medium and clairvoyant.   I work with voice vibration and tuning into energy as well as working with other tools if I do need them.  I absolutely love working with spirit and my guides with a passion.   I connect very strongly with animals during readings which bring through great meanings and medicine.  I am a very down to earth reader and my objective is to send you my caller away ready to cope with what you need to, giving you options and explanations to blockages or obstacles in your life.  For me its about getting your guides and my guides together and making some progress. My main guide \"White Feather\" is very stern but we make a good team and we do our best to help where we can. ",
    "question1": "I love the buzz and I love people and I love to help.   I find my job very very rewarding.   A smile or a tear on a clients face when a reading all falls into place, its priceless.",
    "question2": "Being an Aries I do have the typical traits of impatience of the Ram and a bubbly personality but with my ascendant in Scorpio and my sun in Aquarius it does give me a bit of a mix and I would not say I am a typical Aries.",
    "question3": "I had a near death experience when I was 29 and I was made to awaken.  I was born into a family where the females read tea leaves but I never had it forced upon me and I was left to find my own way.  I wasn't listening so I was made to listen.  I now understand my childhood better as I seen and heard a lot of things so I know I have been like this from a very young age.  My great granny is my family guide around me daily to help me with readings, I don't read tea leaves like she did but she does guide me in other ways. ",
    "question4": "After reading now for over 15 years it is hard to pick one particular experience but I do feel it may be the day I seen my friend's husband's grandad in the crystal ball.  It brought a lot of comfort to him and it kind of made me understand what I am on earth plain for.",
    "question5": "Life experience is high up there, as I have had many obstacles in my own life.   I have also done counselling and NLP courses, psychotherapy and hypnotherapy and these qualifications all help me as a reader.      My first love is Reiki and I started my whole journey with Reiki, now a Usui Master and Grand Master. This does help me with the energy side of readings.   I pick up on the energy of a client and the colours I can see can help with healing or to identify blockages in chakras.   I have done courses within the Shamanic realm and this is where my connection grew stronger with spirit animals. I also have a diploma in past lives and this can help when we have relationship issues which may actually go back to previous life connections.",
    "question6": "I have had many a reading myself and for me I am very much drawn to a face so if you are drawn to a particular reader then the chances are you will get a good connection between you.   I always ask clients to come with an open mind and be relaxed before you pick up the phone and ready with questions as a reading can go so very quickly, so make the most of it.   I am a very straight to the point reader and I will not give you \"fluffy stuff\", please be aware of this before you call.   Also as a practising medium of many years I cannot guarantee who you want to come through will actually make an appearance, so an open mind is very much required.  Most of all relax and enjoy and be aware if you do not like anything you hear you have the \"free will\" to make those changes, not everything is written in stone."
  }
]
