[{"id":1478,"display_name":"Sara C","pin":4440,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/OL9y1422359756-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Tarot cards, life coach and my very strong intuitive ability.","personal_story":"I have been reading the tarot cards for over 15 years now and they always give me accurate and beneficial messages. Over the years i have developed my tarot reading skills by reading them intuitively which can give even more insight into a situation. Over the years i have developed my psychic ability and become more spiritually aware.\r\nI can always offer you reassuring, calming and intuitive guidance, and you will be a lot wiser to the situation. I have been through  many ups and downs in my life and i can relate to your  matters, so nothing will phase me..\r\nI offer you my warmest welcome and look forward to hearing from you all.\r\n ","question1":"The tarot cards are here to give you guidance and knowing that i can help in some way gives me great satisfaction.\r\nI always offer calm and light guidance and you will feel refreshed and positive about your situation.\r\nYou will see some light at the end of the tunnel.","question2":" I am a very typical Arian women, very headstrong, ambitious, honest  and full of life.\r\nEveryday is a new and positive for me  and i embrace new challenges that come my way.\r\n \r\n \r\n ","question3":"Since my early 20's i knew i had some strong psychic ability but i only looked in to this as i got older. I started to become interested in the tarot cards and spiritual world as i was just fascinated by it all. My interest is always growing as there are so many areas to develop in.\r\nI had spirits visit me in my dreams many years ago and often couldn't understand why. I now know why as i have realised my true calling was to give insight and guidance to people from all walks of life. The past now makes much more sense, and i believe everything happens for a reason.\r\nAlso being told by many credible mediums\/psychics that i should be reading for clients also helped me go forward in this area.\r\n \r\n ","question4":"All my client readings are private and all are memorable to me only.","question5":"I am also a life coach and i can give you support and meditation suggestions to get clients  through some challenging  times.\r\nMy mentors are spiritually gifted and help me grow and develop in this area throughout the year. ","question6":"To have an open mind  relax and to remain positive. If you are open to having a reading then it is beneficial to stay focused and calm.\r\nA few deep breaths can help and also a clear mind, this way you will receive the guidance needed to help you further.\r\nThanks for reading my profile and i look forward to hearing from you. x\r\n "},{"id":1527,"display_name":"Lorna Max","pin":4726,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/gZrr1518788259-120-120.jpg","status":"Available","favourite_story":"","favourite_story_approved":0,"callendtime":"2018-10-15 15:30:00","description":"Psychic Clairvoyant - Medium - Shaman - Energy\/Voice Vibration - Tarot\/Oracle Cards - Animal Guides\/Medicine","personal_story":"Hi there, I am a fifth generation psychic, medium and clairvoyant.   I work with voice vibration and tuning into energy as well as working with other tools if I do need them.  I absolutely love working with spirit and my guides with a passion.   I connect very strongly with animals during readings which bring through great meanings and medicine.  I am a very down to earth reader and my objective is to send you my caller away ready to cope with what you need to, giving you options and explanations to blockages or obstacles in your life.  For me its about getting your guides and my guides together and making some progress. My main guide \"White Feather\" is very stern but we make a good team and we do our best to help where we can. ","question1":"I love the buzz and I love people and I love to help.   I find my job very very rewarding.   A smile or a tear on a clients face when a reading all falls into place, its priceless.","question2":"Being an Aries I do have the typical traits of impatience of the Ram and a bubbly personality but with my ascendant in Scorpio and my sun in Aquarius it does give me a bit of a mix and I would not say I am a typical Aries.","question3":"I had a near death experience when I was 29 and I was made to awaken.  I was born into a family where the females read tea leaves but I never had it forced upon me and I was left to find my own way.  I wasn't listening so I was made to listen.  I now understand my childhood better as I seen and heard a lot of things so I know I have been like this from a very young age.  My great granny is my family guide around me daily to help me with readings, I don't read tea leaves like she did but she does guide me in other ways. ","question4":"After reading now for over 15 years it is hard to pick one particular experience but I do feel it may be the day I seen my friend's husband's grandad in the crystal ball.  It brought a lot of comfort to him and it kind of made me understand what I am on earth plain for.","question5":"Life experience is high up there, as I have had many obstacles in my own life.   I have also done counselling and NLP courses, psychotherapy and hypnotherapy and these qualifications all help me as a reader.      My first love is Reiki and I started my whole journey with Reiki, now a Usui Master and Grand Master. This does help me with the energy side of readings.   I pick up on the energy of a client and the colours I can see can help with healing or to identify blockages in chakras.   I have done courses within the Shamanic realm and this is where my connection grew stronger with spirit animals. I also have a diploma in past lives and this can help when we have relationship issues which may actually go back to previous life connections.","question6":"I have had many a reading myself and for me I am very much drawn to a face so if you are drawn to a particular reader then the chances are you will get a good connection between you.   I always ask clients to come with an open mind and be relaxed before you pick up the phone and ready with questions as a reading can go so very quickly, so make the most of it.   I am a very straight to the point reader and I will not give you \"fluffy stuff\", please be aware of this before you call.   Also as a practising medium of many years I cannot guarantee who you want to come through will actually make an appearance, so an open mind is very much required.  Most of all relax and enjoy and be aware if you do not like anything you hear you have the \"free will\" to make those changes, not everything is written in stone."},{"id":1553,"display_name":"Anthony","pin":4629,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/6mHz1428913538-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Psychic - Tarot - Spiritualist Medium - Crystal ball - Water and Wax stick readings","personal_story":"Hi I’m Anthony, I’m a spiritualist and third generation medium. I’m also a psychic, tarot reader, pendulum dowser, crystal ball\/water and wax reader and also take stick readings (for anyone unsure of what that is, someone gives me a stick and i give them a reading from it, you would be surprised how accurate the readings are!). I love to explore different ways of divination and scrying and I am fascinated by the history and philosophy of spiritualism and divination. In my spare time I spend time with my wife and (small) child, love researching my family tree, enjoy cooking - especially new dishes, enjoy trips away and I am slowly writing a novel. ","question1":"Years before I ever started to give readings I was told that part of the reason I am here is to give advice and to help others. When I am giving guidance I feel at one with myself, with spirit and, sometimes, with the questioner. It can be an amazing feeling, the connection with spirit. A healers job is to be a channel, or medium, for spirit, whereas a mediums job is to be a healer, to heal through the messages they give. To give advice to people at a low ebb, to help illuminate a direction for them and give advice without judgment is the most important thing about what I do.\r\nRecently I was on platform in a local hall with a psychic. With the first message I gave spirit shone love on them, through me, and that love was so strong it was the main thing I felt for the next three and a half hours until the end of the evening. Readings can be amazing, the messages you give, stories you hear and feelings you encounter.","question2":"In some ways I am a typical Aries; I’m positive, passionate, stubborn and impulsive. I’m also very loyal and enjoy new experiences. I often come across as confident, strong willed and enjoy meeting new people. I do believe in star signs, although not the general readings in the paper. I have had a personal reading from a very well known astrologer - and he was spot on with almost everything.  ","question3":"I have been aware of having spirit around me since I was a toddler. When I started playgroup I had to be taken home as I hid under the table, refusing to come out, complaining that there were ‘too many dead people in the room’. I am strongly clairsentient, as a child my parents had paintings of my (long deceased) grandparents on the wall and I could feel both of them in the room, I was able to say where they were, how tall they were, what they were wearing, how they felt etc. I also have a strong psychic link with family and friends. In my early teens I had readings from two Tarot readers who both told me that I had ‘the gift’. My Mum bought a set of Tarot cards and a book to teach herself how to read, she would lay the cards out in her spread, open her book in readiness - and I would annoy her by turning the cards over and quickly, card by card, announcing what each card meant and giving the other person a potted, on the spot reading from what I felt the cards were saying to me....she would then turn them back over and start her reading. Twenty minutes, and much page turning, later she would finish....and her reading would be the same as mine.","question4":"There are several. As a medium I have had people who have committed suicide come through, as well as murder victims. I remember being on platform once and telling someone that they had just been through a heart wrenching split which they \r\nwere slowly adjusting to. She started to cry. I remember reassuring her and telling her that she was, step by step, going to find balance in her life and move on. I also realised that it was a last minute decision to be there that night but she felt she needed guidance. I told her that her mothers mother was with her, she should feel her presence right behind her. She was giving her a red rose. At the end of the message she asked if I could tell her any more about the messenger. There wasn’t much I could tell her, I felt her grandmother saying not to mind her, it was the message that was important, all I could say was that she was dressed all in blue. She confirmed the message, including parts I haven’t mentioned here, before telling me that she often felt her grandmother behind her and that she was a no nonsense, down to earth person who was buried in a blue dress with a red rose.\r\n \r\n ","question5":"I have a great deal of life experience. I spent 10 years traveling and performing as an actor before training to be a teacher. I understand how to give a reading to someone, the sensitivity that’s needed in order to make the reading a positive experience. I have also worked in care, a very humbling experience. As well as dealing with doctors, emergency services, psychiatrists and other professionals caring for those who were dying, and their grieving relatives, taught me a lot about empathy, sympathy and something about the nature of life.","question6":"All I ask of anyone is to be open to the experience and remember not to give too much information away, it’s my job to give you a reading, not for you to tell me all about your self and your troubles! Remember, I will not tell you anything 'nasty' - about deaths etc - and I am not here to be a 'fortune helper'- I will not tell you whether you will have a baby or win the lottery or which horse to back. I will tell you about yourself, your situation and give you an honest reading. Another thing to remember is to relax, enjoy the experience and I hope you will take something away with you.\r\n "},{"id":1703,"display_name":"Valentine","pin":4704,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/laEj1441368160-120-120.jpg","status":"Available","favourite_story":"","favourite_story_approved":0,"callendtime":"2018-10-15 15:30:00","description":"Angel cards,Angel guides, Pyschic, Medium","personal_story":"I have been aware of spirit all my life. My mum and my auntie are both spiritual mediums and also my grandmother and my great grandmother. We come from the Romany gypsies on the Italian side of the family. I was brought up with this, seeing my mum working as a clairvoyant medium in churches and charity nights and clairvoyant evenings and also private sittings. My mother brought me up and helped me with my gift. As a child I would always see spirit, and as an adult I have learned to communicate with them and use this gift.","question1":"To help people, and to give them more of an understanding and help to see what the future holds. To also give guidance and love.","question2":"I am confident, determined, will always fight through for what I believe is right. I am understanding and caring in nature. I love animals and children.","question3":"When i was a small child I would talk to spirit.","question4":"To see the smile on peoples faces, or to hear the happiness is the voice because i have given them something to feel happy and positive about.","question5":"Its good to have the evidence and feedback from clients from messages i have given. I am very caring in nature, this shows in my readings.","question6":"Each person is different and would have to decide themselves for what they want from each individual reading. You can choose to have a general reading or focus on something specific if there's any issues in their life at that present time. The choice is yours."},{"id":1698,"display_name":"Tess","pin":4519,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/1MBW1441630794-120-120.jpg","status":"Available","favourite_story":"","favourite_story_approved":0,"callendtime":"2018-10-15 15:30:00","description":"Tarot card - Angel Oracle cards - Unicorn cards","personal_story":"Hi there I'm Tess and I'd love to join you on your tarot journey. Tarot have been in my life for over twenty years the oracles joined me around seven years ago. \r\nI love to assist people with the help of the tarot and oracles along a magical journey. I believe tarot helps develop an insight a guide to resolve issues , questions and open possible pathway when you can't see the wood for the trees so to speak. \r\nI like to give hope when someone feels there's none , compassion in times of need. I also love to ask my guardian angel to assist and lend an understanding thought.\r\ni do hope you give me a call so I can join you on your journey. \r\n \r\n \r\n ","question1":"I would say what I most like about reading for people is being a part of their journey. Learning together about their past, present and building a brighter future. \r\nI love to hear hope in someone's voice and never be judgemental of someone's situation. \r\nHaving been through so many journeys myself I feel helps my clients , I can always empathise with someone.","question2":"Oh my gosh I am such a typical piscean. \r\nI'm kind, extremely caring and highly emotional. \r\nI love to look after my family and friends and always try to take their problems and help resolve them. \r\nI am a dreamer , and see good in everyone, always giving people the chance .","question3":"I would say as long as I can remember I have felt someone is with me guiding me and helping me learn right from wrong. \r\nI've always felt the urge to help people. There has always been that sense of déjà vou in many situations throughout my life. \r\nI was gifted my first deck of tarot many years ago and still today find the deck one of my favourite to help clients especially with relationship readings. ","question4":"All my clients are memorable . I would not and could not pick any particular experience. \r\nI just love readings where you can almost feel your client smiling at the other end of a phone. Recently I managed to make a dear friend burst out laughing as she had been hiding stuff about herself , yet I managed to find out what it was. \r\nBut I sincerely love joining people on their journey.","question5":"My life is my experience . Being an understanding and not judgemental really really makes the tarot so personal and a pleasure to be able to share my gift with others. ","question6":"Firstly I would say know exactly what it is you wish to ask a reader . Go to a reader with you mind open and willing to hear things and learn things that could surprise you.\r\nremember the tarot is just a guide , a pathway to a future. You can change the outcome if you find yourself straying from that path.  \r\nWhen choosing a reader always go with your gut instinct . It maybe the photo you see before you or the words we choose to use to tell you a little about we are. \r\n "},{"id":1790,"display_name":"Celeste","pin":4938,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/V7sY1450453287-120-120.jpg","status":"Available","favourite_story":"","favourite_story_approved":0,"callendtime":"2018-10-15 15:30:00","description":"Psychic, clairvoyant, spiritual healer, tarot, angel cards, healing with the angels, spiritual counsellor, dowsing, runes.","personal_story":"Hello.  I'm from a long line of psychics, i also have a great gift of clairvoyance - being able to see, feel and hear peoples needs. I know it is my life purpose to do this. I love life and helping people to deal with the challenges life brings, to give them clear guidance and validations they're on the right path. Life has never been easy for me, and feel i've plenty of life experiences to help others on their journey.","question1":"Helping a client to feel more uplifted, with my gifts given to me from spirit, i'd like to share these with all that need help and guidance. i like to help relieve their pain, anxiety and suffering by connecting with their guides and angels through my various methods of readings.","question2":"As a typical Gemini, we are light, mental creatures desirous of contact and communication, with deep loving abilities. we're good at forming ties with people on many levels. As original thinkers we are the bearers of human news. Also being very versatile, Sensitive and deeply curious about life.","question3":"As an earth angel born into a human body, i was born with this gift to help and heal others.","question4":"When i read for a lady several times who was so distraught she had lost her soul mate and felt she couldn't carry on, with a few sessions and giving her healing energy and numerous readings, we connected with her loved one and he gave her validation that he was happy doing what he loved now - which was an architect in the spirit world. She then went on to tell me that that was his life long dream. she was consoled at last. ","question5":"As a spiritual counsellor and hypnotherapist im great at listening and empathising on all levels to help the client empower and gain control of their own lives.","question6":"To be open minded, calm and relaxed during your reading."},{"id":1845,"display_name":"Liz","pin":4964,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/IIo21455790886-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Psychic clairvoyant medium tarot","personal_story":"My name is Hazel I have been doing specialised readings for people over the last 5 years I am a caring and compassionate reader with healing and mediumistic abilities . I have a great insight to delve deeply in to issues affecting you in the present. I look into the future and shine light on your forward journey and find the answers you need. My interests are healing reflexology reading and cinema","question1":"Talking to different people with individual problems and trying to clarify advise and help move forward I encourage people to come back to me with the outcome ","question2":"","question3":"I have always known I had a special gift from about my teenage years and have Romany ancestors I always go with my gut instinct and never appears to be wrong","question4":"I have a few good memories Iam most happiest when people come back to me and all the help and advise has worked and they are in a much more positive place in there lives and are content and it pleases me that I have been a big part of the successful outcome","question5":"I worked in a hospital for many years so have always been a caring person also have experienced loss of loved ones and divorced after many years they have not all been easy situations to deal with but think this has made me a stronger person   and gives me the experience to help others","question6":"Respect, caring trying to understand , compassion , and confidential are what is required for each individual , I hope to make a difference "},{"id":1874,"display_name":"Gee","pin":4009,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/NjN41456849789-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Tarot & Runes","personal_story":"I have been a reader of the Tarot for over 20yrs and am still constantly amazed at what an amazing and insightful aid it is in Psychic work. I was born with a clairvoyant gift but it wasn't until my twenties that I began to truly open up spiritually and practise using it. As one matures the gift does also and it becomes easier to access so I hope this will only continue to improve the older I get!","question1":"I like being able to shed light where darkness prevails and offer some intuitive insight and hope into peoples lives. Being a reader allows me to do this and can be very satisfying knowing you have been able to help people in such a unique way.","question2":"I am not typical of my Sun sign, as I was born a few minutes after midnight on a full moon and was a ten day late baby I see myself as more Scorpio really. My Scorpio traits are perfect for Psychic work and allow me to deal with all aspects of life even those some people shy away from.","question3":"I was very young, about 4 or 5 when I realised I could see ghosts, this was the beginning of it but was discouraged by my parents. As I grew older I could instinctively 'know' what people were going to do or say next and often predicted things ahead of time.","question4":"I can't say as I have them, I tend to instantly forget people's readings.","question5":"I am also qualified in Reiki healing and EFT Emotional Freedom Techniques","question6":"I think some people expect you to predict their entire lives, which I don't do. But being open minded and accepting that the future is not set in stone helps. It can be changed by their decisions and choices so this is important. Some things will happen that are outside their level of influence and these are the land marks that a Psychic can pick up on. And also sometimes that which the person feels is the most important thing at the front of their mind is not in fact what is shown as being more relevant. And being prepared to grow and develop as a person helps. If people have become very stuck it shows in their lives."},{"id":1915,"display_name":"Mary","pin":4372,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/eGMa1458145072-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Psychic Tarot Card Reader including Angel Cards","personal_story":"Hello there, my name is Mary and I have natural psychic ability. I use my intuition, Tarot Cards and Angel Cards to give clarity, help and guidance.  I have been very intuitive since childhood with the gift of being able to see through situations that others can’t.  I attended a Psychic\/Spiritual Circle in the year 2000 onwards to enhance my gifts and healing abilities.\r\nI can also offer Spiritual Counselling to help with all those ups and downs in life, giving support, empathy and a positive outlook.","question1":"I enjoy helping people using a direct approach. Sometimes when we go through difficult and emotional problems it can be hard to see the wood for the trees. It’s good to help people with putting situations in to perspective, in most cases there is light at the end of the tunnel and I love explaining this and giving clarity.","question2":"By nature I tend to be quite direct and I believe that honesty is a huge asset. Knowing where you stand with someone is very important to me. I have inner strength and I’m very open- minded.  I believe these traits to be typical of Aries.","question3":"I was very young and I remember having a conversation with a friend and having a feeling of knowing exactly what she was going to say next and I was 100% correct word for word.","question4":"I was giving a reading to a lady who had been out of work for many months and consequently lost hope of getting a job due to her age. I advised that she would receive a phone call in about 2 weeks time with a job offer but I couldn’t see an interview around this.  It all seemed quite strange.  I received a call from this lady 3 weeks after the reading and she advised that she had an interview with a company 7 months ago but wasn’t successful at the time.  However, a similar vacancy had arisen within this company and they had contacted her around the time I stated, to offer her a similar position.","question5":"I am also a qualified Holistic Therapist\/Healer. My therapies include Reiki (Master), Reflexology, Shiatsu and Indian Head Massage. I have lived in 3 countries and I’ve had many ups and downs in life which enables me to empathise with my clients in an open minded and non- judgemental way. ","question6":"To be open and just be themselves, which enables me to tune in to their true energies and feelings. "},{"id":1921,"display_name":"Serena","pin":4718,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/ulfH1459348778-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Psychic Clairvoyant, Tarot and Angel Cards.","personal_story":"Serena is a certified Angel card reader having trained with the wonderful Doreen Virtue and Radleigh Valentine, as well as being a certified Tarot card reader.  At your reading with Serena you can choose either Angel cards or Tarot cards, or a combination of both.  Topping up her card reading expertise, Serena will bring to you a wealth of astrological knowledge as she is also a qualified Astrologer having gained her certificate at The Faculty of Astrological Studies in London twenty five years ago.  She also has taught beginners astrology at adult education level.   Last, but not least Serena is a practicing Reiki Master;  she also teaches meditation and at present is studying to become a Holistic Coach.  With so much experience and knowledge at her finger tips you will unequivocally benefit from Serena's card readings of which she will deliver to you with sensitivity, empathy, guidance and compassion.   ","question1":"This sounds an awful cliche, but I never fail not to be bowled over with joy when a client tells me I have changed their life around for the better in some way after a reading with me!  Basically my mantra is 'to be of service' wherever I can, and if I am able to help a client shift their stance, even just very slightly, to take on a different viewpoint or approach to a challenging situation, then this makes the reading extra worthwhile for me and brings me so much pleasure.  It is wonderful to witness someone having an 'ah ha' moment; when something slots into place or comes up to their consciousness that they had hitherto not been aware of.  This then provides my client with a whole new set of coping skills.  To handle a relationship or situation in a different way marks the beginning of healing and change - after all, it is said that \"Nothings changes until you change\".  I never fail to feel honoured and privilaged if I can help to bring this about in some way.","question2":"\"Gemini's greatest gift to humanity resides in his\/her ability to communicate ideas.  Thus Gemini finds tremendous purpose as an educator\".  Tick!  That's me!  I am never happier then when I am passing on helpful information to my fellow human beings.   So, to answer the heading question, yes, I believe I am true to my star sign.  However we all reach this admirable place at differing times in our lives; some find it sooner than others and it all depends on your individual birth chart and how your own personal journey pans out.  From birth we are in a continuing process of becoming the very best of our Sun sign and it does not necessarily manifest immediately at birth, (indeed, we live in the energy of our Moon sign for the first seven years of life), but it is an ongoing process different for each person because each and every one of us is completely special and unique.  I, as a Gemini, tick many of the descriptive keywords we attribute to Gemini:  cheerful; adaptable and easy going; friendly; sensitive to others; quick-witted; flair for writing; loves communicating and so on.  I am however a very 'watery' Gemini, so this bestows upon me strong intuitive and psychic capabilities to mix with my Gemini energy.  I look forward to demonstrating this to you!","question3":"I first became aware of my gifts about thirty years ago and it came about in a rather round-about way!  I was having some hypnotherapy to try and give up smoking (which I have accomplished!), however the hypnotherapist clearly picked something up about me and asked if I was interested in astrology.  I told her I didn't know anything about it and I asked her to fill me in.  Goodness me, I was hooked immediately and I asked her to recommend me to a local teacher.  I went on eventually to study at the prestigious Faculty of Astrological Studies in London where I gained my certificate.  Then the Tarot came into my life shortly thereafter and I sort out a reputable teacher.  My life changed irrevocably from that moment on, definitely for the better, and I have never looked back!","question4":"I have been blessed with many memorable experiences, but the latest situation that comes to mind brings me much joy when I think about it.  A client came to me at a time of transition in her life.   It was clear from her cards that there was something new and big waiting around the corner for her; we just had to get her there.  Basically the brief outline of the story is that according to her it was due to my intuition and advice that she decided to train as a healer.  After a subsequent reading it was clear that this was not the end of the story and I felt the acquisition of a business was 'on the cards' so to speak!  This has now all manifested and my client is on 'cloud nine'.  Yipeee!","question5":"Apart from my qualifications already mentioned, I am a Reiki Master.  This qualification I feel most aptly compliments my card readings.  I feel strongly that whichever way one endeavours to help other people, the approach is always holistic in that every situation or emotion can be related to mind, body and spirit.  In just the same way that the healing energy of Reiki can aid people in so many ways including giving them a deep sense of well being; reduced stress; release of negative emotions; increased confidence and creativity to name but a few, when a client comes to me for Reiki therapy I always spend time talking to my client about their issues offering appropriate advice where needed.  This too is the same principle with card readings and my approach is essentially holistic.   It is said that \"Tarot cards can show the problem, but at the same time also show the solution\" and my expertise as a Reiki Master and Spiritual teacher melds very nicely with giving help and advice on all levels when interpreting the cards. I explain that it can be a persistent negative thought or emotion, that might prevent the client from attracting what they would like to manifest, or prevent them from moving forward from a challenging situation or person.  I am also at the moment training to become a Holistic Coach so this can only further add to my experience.  I  also have further teaching experience in that I taught beginners astrology for my local county council at adult education level some years ago, so the experience from this I believe further enhances my work as a reader as I can explain how planetary energies can be a player in their present situation and offer coping skills.   As well as this, at present I teach beginners meditation and relaxation techniques giving my students a myriad of tips in order to help navigate through the hectic energy we are now living in day to day.          ","question6":"Thoughts and the spoken word are extremely powerful!  Before booking a reading, I would recommend a client to consider that once the reader has offered their interpretation of the cards and any advice given, it is advisable to practice discernment and basically not to try and deliberately make their life pan out according to the information given.  It is important to allow situations to unfold organically.   There is a very fine line, I believe, that has to be trod when reading cards and that is not to interfere in another person's spiritual growth, i.e. prevent them from making decisions which are, in themselves, an opportunity for growth, (even if we feel we have made the wrong decision, we will always learn something along the way to our benefit).   I would advise any client before arranging a reading to remember the reader is always working for their client's highest good but to remember discernment and to remember that you always have 'choice' which is essentially so empowering.  I would also point out that our higher selves, from which we gain our intuitive insights, do not have a calendar or a clock so it is important to be flexible about any timings given.  So often other matters have to come into consideration before what has been predicated can manifest, so I feel this is an important point to factor in before booking a reading.   The above thoughts, I hope, can help a client approach their reading with an openness that can prevent setting up any disappointment but only improve their life tenfold! "},{"id":1936,"display_name":"Tangerine","pin":4482,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/7iAk1461245460-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Clairvoyant - Claircognizant.- Clairaudient.- Clairsentient - Medium - Healer - Tarot","personal_story":"Hello,  Tangerine here, introducing myself as your psychic healing medium reader today. I have been working professionally as a psychic healing reader for more than fifteen years and I utilise a variety of mediumistic skills to bring you the best and most accurate information direct from spirit.\r\ni am kind and caring in nature and have a reassuring and infinitely comforting manner and style of working, I am always very interested to hear what's happening for you in your life and I truly enjoy helping clear confusing life choices, puzzling life challenges and involved personal and vocational and family situations. I am thrilled to witness healing occur and witness solutions constantly presenting themselves to clients time and time and time again. \r\nIt is always a pure privilege to be able to participate so significantly in this profound work.","question1":"I find I thoroughly enjoy the part of the reading where it all \"makes sense\" to the client, and to me.\r\nI totally love being able to directly link with spirit correctly connecting to the client and really getting to the bottom of what's happening for them in their life. \r\nEvery time we connect correctly and identify what's what and can see the cause and result of any given situation I love it. \r\nIts really very exciting for me and the client, to clearly view the journey and correctly see the past and present and the future outcome. Always amazes me and I heartily enjoy it every time. \r\nA fantastic job to do and I give thanks daily for the gift with which I have been so blessed. ","question2":"Ha, I am a typical Sagittarius female because I love to spend money, I am really outgoing and quite loud too!!! I adore getting together with groups of friends and I can be the clown of the party after a while as well. I think typical Sagittarius girls love to have fun and dive head first into the deep end of whatever they do and I'm no exception there! I am friendly and sociable but also rather shy on the inside and can cover any awkwardness with silly funny antics and I can sometimes be found showing off a little too!! Although my close friends understand me so I'm usually ok. Thank goodness. I think I have the Sagittarius quirk of eccentricity and I can chose quite unusual pastimes and companions, this stretches to buying unique and interesting pieces of furniture for my home too! I love to travel at home and abroad, I have still a few far flung places on my travel bucket list. I adore the outdoors, I totally intend to live in a warm climate so I can be outside for more of the time. I love animals and nature fascinates me, I am involved in caring for the planet and conserving nature. I have lots of fun when involved in activities with the younger generation and children and youth. We seem to get along famously and I have a large friendship circle of much younger people with whom I regularly spend weekends with whenever the opportunity presents. I am very fair and a stickler for the truth and honesty, and I tend to champion the underdog. I can be fastidiously sensible but also amazingly reckless, so my mum tells me anyway! ;-) x\r\nAll in all I feel a I'm a pretty typical Sagittarius girl I would say! X ","question3":"I first became aware I could read tarot with remarkable accuracy when my mum bought my sister and I a pack of the Rider Waite tarot cards when we were in our early teens. The cards were only the major arcana and they had the meanings written on the front of the cards but we pored over them endlessly. I remember being amazed at how accurate they actually were. \r\nAs I grew older I was introduced to mediums by a new friend, and after seeing a few, one of them confirmed I had been communicating with my paternal grandad  whom had passed away when I was twelve. I thought I had been imagining it, I remember crying all the way home, walking down the road. I was overwhelmed with emotion I was so happy to hear this unexpected news. I loved my grandad very much and to be informed that I was definitely in touch with him was such an amazing feeling.\r\nSince then I saw another medium , one of many I visited, who suggested that spirit were \"letting me bring up my children\", and it seems that he was spot on. As my children have gotten older my psychic skills and gifts have blossomed and grown and the healing gifts have become more and more evident too. \r\nA wonderful journey so far indeed. Truly in line with what I've been told. I feel immense gratitude. I give thanks to the many great mediums and healers out there who are doing great work, and to those who have gone before us I give thanks also.","question4":"I think one of my most memorable experiences with a client was with a lady who came to see me when her close family member was near to passing away, we did her reading and I was obviously very sympathetic about the situation. We discussed her family member and his character and the situation in general. \r\nAfter his passing a few months later she came to see me again for another reading, she wanted to know whether the family member had passed peacefully back to spirit and if he was ok. \r\n Apparently he hadn't been there long enough to be strong enough to come through or was otherwise unavailable to connect with us, however an angelic energy came through to talk on his behalf. This angelic energy told us that they had received him back into spirit and had helped with his passing over, the Angel confirmed that the chap was doing ok and had passed through peacefully but there was something that had been really bothering him, on his passage as he was arriving and apparently, the Angel informed us, there was something he kept repeating over and over again. The Angel relayed to us that the chap was really really really concerned about a watch or clock of some kind.\r\nHe was apparently adamant he wanted to make sure of something to do with a time piece. \r\nThe lady client threw her hands to her face immediately knowing to what he was referring. \r\nApparently there had been quite a to do, with certain relatives squabbling over the inheritance and the lady client had had to be extra careful to successfully grab a hold of an old pocket watch, which the deceased had really wanted to be handed down to a young male special favourite friend of the family. In his eyes saw this boy as family and was really concerned that the watch be handed down to him.\r\nWe thanked the Angel profusely and I think we both shed a few tears of joy in the confirmation and clarity of that particular message. \r\n Suffice to say we assured the Angel that they could pass on the message that the young boy had in fact received said watch and all was well.  \r\n ","question5":"I feel my twenty six years as a parent, my charity work, my personal experiences working with girls who needed special attention on account of difficult home lives, and incidents in childhood, my always having worked with the general public and people in general and the fact my mum, a huge inspiration to me, is a teacher all qualify me and compliment my skills as a reader and healer. I have repeatedly attracted healers and light workers and people who care for others in my life journey and my interest in how the mind works, meditation, theta healing and clearing life issues research has really stood me in good stead for my work as a psychic healer and medium.","question6":"The most important thing for a person to consider when having a psychic reading is to be sure they want an honest answer from the reader, to be happy to carry on with their lives regardless of the content of the reading and to know that every message that comes through is direct from spirit as a comfort, guide, helpful piece of news and gentle nudge in the right direction at all times. Spirit can see the past and present and future and every message is meant for our highest good at all times xxxx"},{"id":2001,"display_name":"Acacia","pin":4441,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/Usgn1465996254-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Psychic, Clairvoyant, Empathic Healer Energy Medium working with Spirit and the Universe","personal_story":"Hi,I'm Acacia. I've been working with and for the Divine True Light for over 30 years. I'm empathic and feel the emotion,vibration of others and what is around.  ","question1":"I love how Spirit comes through with so much love and fun. We have a giggle,which helps to make the client more comfortable and at ease. It also helps in raising the vibration....especially in difficult situations.","question2":"I would say that I am very much like the typical Aquarius.....but not so aloof...as some descriptions would have us be. I'm quirky,up beat and off beat. Humanitarian and friendly. ","question3":" I've always had the gifts that I have,but they became more prominent in my life in my late teens","question4":" Most memorable is one of where a clients Angel came through and placed sunglasses on me and said.'These are to protect you' Even though she had lowered her vibration,it was still very strong and could have blinded me. It was a spectacular vision and an experience of joy...even though both the client and myself ended up feeling pretty emotional ","question5":"I am a Wisdom Keeper...receiving and holding wisdom for when it is needed. I'm also a healer and Spiritual Coach and Advisor.\r\nIn doing work with and for the Divine True Light for 30 years,I have gained much knowledge and experience which is beneficial for others and for the world","question6":"I feel the most important to consider is to have an open heart and mind.\r\nBe specific in the questions that you seek guidance for and be prepared to hear the truth from the heart of spirit"},{"id":2116,"display_name":"JJ","pin":4680,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/QmUa1474968016-120-120.jpg","status":"Available","favourite_story":"","favourite_story_approved":0,"callendtime":"2018-10-15 15:30:00","description":"Psychic clairvoyant, tarot cards.","personal_story":"“Hi my name is JJ and I am an experienced tarot and psychic medium reader with over 8 years’ experience of reading for people. My gift has been passed to me from my grandmothers on both sides of my family. And it has strengthened throughout the years. I can help you with love and relationship questions also matters concerning your career and family issues. I also do general readings and readings on specific things important to you. I am a non-judgemental person and I never judge on a client’s situation, I am just here to advise on what my guides are telling me for you with guidance and assistance .  Call me for a professional and calming reading. I will always endeavour to answer all of your questions.” ","question1":"For me it’s like stepping into a person's life for the period of their reading. It is as though I am standing next to them, \"seeing\" the people or situations both as they presently are as well as forthcoming in their life.\r\nHowever I have given many readings over the years, and I am still astonished every day that the information emanates to me with such remarkable lucidity, and that my readings are filled with significant, personal details associated to current or impending circumstances, events, or people for the client.\r\nIt is important to me that my customers are comfortable during their reading. Though I talk about some of the utmost intimate concerns in their life, it does not escape me that we are strangers when we first meet, they don't really know me or how I work. Over the years I have learned that each individuals experience has a variation of emotions when they first come for a reading, and when they are relaxed they can hear me.\r\nI know there are readers that will tell people whatever they want to hear, but I cannot. My promise with God is that I must tell people what I see for the reason that, \"the truth only has one story,\" and there is a purpose this information is coming through. I will never dispute with a client about what I see in their reading, nor will I ever change what I say just to appease them. I tell you what you need to know not what you want to know and this sets me apart from many readers.","question2":"I am social and adept at bringing people together so I’m a great mediator in and out of work. Reading people and understanding people's motivations comes naturally to me, and I can often use this to my advantage in any job or career field. I’m a people person at heart, so working with others is crucial to my happiness. I have a knack for conversing with others, adapting to change has never been an issue of mine, and encouraging others to enjoy the jobs that they do. I’m quite flexible when it comes to working. I love to travel and learn from others in every part of the world, I also love inspiring others.","question3":"Have intuitively developed my clairvoyant and clairaudient abilities through the years. But I’m quite luck to say I have been born with this gift, I come from Indian Irish and Spanish origin, both sides of my family as far back as I can remember and have been told where Medium’s and Psychics.","question4":"I think I would have to say it was a reading for a lady who was actually uncertain of her next steps concerning her life, she really didn't know which way to turn. I made a strong connection for her with spirit and her Tarot cards were backing up what I was being told. I told her within the next few weeks a new job opening would come up in her present vocation and it would be offered to her and it would require her to move country, I told her the move would be quite beneficial to her and she would settle and fine love.  She contacted me a few months later to thank me for giving her the courage to make the right decision and that she had never been happier. That is what Tarot readings from spirit are all about, I cannot tell you what to do I can merely give guidance which equips you to make the best decision for yourself.","question5":"I have worked in my church as a medium and also as a youth guidance officer so over the years I have learned how to connect with people and make them feel at ease quite quickly. I am able to get people to feel comfortable to open up to me which makes for good readings, as the more open someone is when they come through to me, the stronger a connection I can make with spirit through the Tarot and the more information I can get from the reading of the cards.","question6":"There is never a mindful choice for me about the importance of information in a reading. Infrequently a client will come with what they think is the most significant issue in their life, nevertheless a different issue may push its way to the front throughout there reading, undoubtedly wanting to be deliberated first. What outlines the order of topics is that which shows itself to be the most important or forthcoming issue.\r\nThere certainly is a natural order of importance to issues in a reading. I tell my clients that, they should write down a list of specific questions they would like me to address, but to please keep it to the side until I have finished their reading. Nevertheless I have usually answered all of the questions on the list by the end of the reading, they are free to ask whatever questions they may have, whether on the list or something they just thought of. If they feel it is important to them, then it is important to me."},{"id":2153,"display_name":"Lavinia","pin":4254,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/lsvB1476776216-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Clairvoyant, healer, tarot card & crystals","personal_story":"I have been a healer & clairvoyant for as long as I can remember & as a child I accepted that not everyone possesses the same gifts & instincts as I do.  I received my first deck of Tarot cards on my sixteenth birthday & it was with friends & family that I started my predictions. My family are Pagan & there are several naturally gifted Tarot readers & healers amongst us.","question1":"When people call on me there are times when I have a lot of information to impart which helps & very occasionally very little or unclear messages but whatever the situation I never temper the truth or change the information. Just because the message seems unclear at the time of the reading doesn’t make it any the less true & it eventually comes to light. I relay the messages earnestly whether it is good or something they may not want or be ready to hear. I do not fabricate anything just for the sake of it, I prefer honesty because of this clients have been coming to me for many years, from all walks of life, different religions & nationalities. Nothing gives me more pleasure & satisfaction than to see a frown disappear. Confusion replaced with knowledge, relief & understanding. Sometimes if a loved one has departed without the time to say goodbye a message can give them much comfort & even closure. I often receive emails six months down the line saying the information I had given them had given them insight & provided clear direction in their time of confusion. I feel blessed to have such a gift & give my time generously to it. ","question2":"As a typical Piscean our ruling planet is Neptune, Pisceans are renowned as being the most intuitive & psychic of all the other signs of the zodiac. Generous & emotional our psychic abilities & intuition are guided by our emotions. I am extremely sensitive & loyal I feel attracted to people with severe problems & who desperately need help, I am there to offer guidance & support.  I am so empathic that my need to help make things better for other people can feel just as important to me as it is to them. As Pisces is the sign of mysticism, mystery & the spiritual unknown, I accept that I must  live in both the real world & the spiritual. ","question3":"When I was very young around five years old I can recall asking my Grandmother who the lady is that sometimes comes to stand by her side & who smiles at me. She casually replied ‘my mother’ my grandmother also has a strong clairvoyant gift but was nevertheless surprised when I said ‘I love the name Isabelle’ she had never told me her name, I just knew it. \r\nThe experience that affected me the most was when I was twelve years old, on holiday in Spain with my mother & sister when I suddenly had the most overwhelming feeling that something was seriously wrong. I climbed out of the pool & ran straight to my mum; by now I was sobbing she was clearly shaken by how distraught I was. It wasn’t until I was trying to get my words out to tell her what I was feeling that I knew myself what was wrong, I told her that my I could hear my best friend crying & that she needed me. She listened, took me directly into the hotel reception & asked if we may use the telephone, a neighbour answered their phone & told her that there had been a tragic accident & that my friend’s father had been killed. I’d never felt so far away from home\r\nWhen I was very young around five years old I can recall asking my Grandmother who the lady is that sometimes comes to stand by her side & who smiles at me. She casually replied ‘my mother’ my grandmother also has a strong clairvoyant gift but was nevertheless surprised when I said ‘I love the name Isabelle’ she had never told me her name, I just knew it. \r\nThe experience that affected me the most was when I was twelve years old, on holiday in Spain with my mother & sister when I suddenly had the most overwhelming feeling that something was seriously wrong. I climbed out of the pool & ran straight to my mum; by now I was sobbing she was clearly shaken by how distraught I was. It wasn’t until I was trying to get my words out to tell her what I was feeling that I knew myself what was wrong, I told her that my I could hear my best friend crying & that she needed me. She listened, took me directly into the hotel reception & asked if we may use the telephone, a neighbour answered their phone & told her that there had been a tragic accident & that my friend’s father had been killed. I’d never felt so far away from home.","question4":"I was asked booked to attend a ladies day at an affluent lady’s house as part of the entertainment; she had hired waitresses, massage therapists & beauticians too. I was booked for the evening by then the ladies were rather merry but the first two readings went very well indeed. Both knew exactly what I was talking about & were raving about their reading. The third lady was a lawyer & incredibly sceptical but decided to join in” for a bit of a laugh”. Her reading was astounding, yet she claimed not to have a clue what on earth I was talking about. Her cards indicated she was to travel to reach her dream job & that she was on the cusp of meeting royalty & embarking upon a successful new adventure. She openly laughed & said it was fun but she ‘wasn’t going to hold her breath’. The very next day she was given the opportunity to do just that, she had been head hunted by an American law firm whose clients are the rich, famous & indeed royalty. To receive an email asking for another reading straight away is the reason I do what do. ","question5":"Apart from being very intuitive I also have a degree in counselling, which fits perfectly & the abilities I gained have given me the confidence to support people who are at a point where they are searching for answers. Combining counselling skills with Tarot reading & delivering clairvoyant messages to people in a compassionate way is why my clients feel deeply cared for & appreciate they that I empathise with them on all levels.","question6":"Before considering a Tarot reading ask you must first ask yourself if you are ready to learn what is truly going on for you right now, is now the right time to highlight the aspects of your life you may not be fully aware of, such as what influences are acting upon you, understand what conscious & subconscious control you are exerting on your life & how these factors may manifest your future. Are you ready to gain a fresh perspective on your life or specific situation? The Tarot is a beautiful analysis tool for getting a clearer, detached view of what you are doing right now & where you are heading."},{"id":2162,"display_name":"Berkana","pin":4593,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/kMvC1477650889-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Medium and Angel\/Oracle cards","personal_story":"Hello and a warm welcome.  I am a medium, assisted by Spirit and Spirit Guides with a lifetime's experience.  My curiosity and life path guided me to become Masters Attuned in Usui Reiki Healing, which has helped develop and heighten my psychic abilities.  The combination of healing and spiritual guidance are truly a gift, given to me to help people to decipher any problems, or ease emotional suffering or struggles.  I always intend to deliver an honest, empathic, warm and positive reading, where my intention is to bring some solace and peace of mind, with the obvious feeling of hope and success to any outcome.   This reading is a quiet, sacred space where Spirit can reach you, to guide you on to your next stage of life, through me to share a special moment with you.","question1":"I have always had a desire to help people and through my own life struggles and experiences I have learned that sharing concerns with others is a way forward in healing internal worries.  I cannot take all the credit as Spirit brings me the information revealing they are there to guide and protect and connecting with this energy has been a real privilege in my life. I have met many, many good and interesting people.  I like to know that I have shared in putting a smile or placing some hope back into a weary heart and soul.","question2":"Aquarians are pretty much a force that is artistic, eccentric and free spirited (excuse the pun).  That is me.  I have a sense of loyalty and freedom and I believe in standing up for what we know to be right.  I am a dreamer, I listen, I care, I would have been a missionary if my life was meant to go in that direction.  Yes I would say I am typical of my star sign.  ","question3":"I have always been aware of energies and possibly looking back I was maybe a bit frightened to tell people about psychic events I had experienced before I reached the age of eight or nine, but as I grew up I realised the psychic connection within my family was particularly strong and present.  I am now proud to have this gift due to the fact I can share it to benefit others.","question4":"I have had so very ma,y memorable experiences with clients that it is difficult to pin point.  All I know is I have assisted along with Spirit to give a sense of well being, hope and love to people who have gone through such terrible tragedies or grief; people make it known when I have helped them and that is the greatest feeling to get a thank you even tears are a great indication that I have released and touched upon negativity and turned it into positive energy.  Some clients are inspired to look into becoming a healer or to develop their psychic abilities.","question5":"I have two Honours Degrees,  BA Honours in Sulpture\/ Fine Art and  MA Honours in Archaeology.  These degrees have helped in grounding me and of course the Archaeology degree helps me connect to our ancestors peoples of the past.  This has heightened my spiritual connection and given me a greater understanding of life itself and our journey.  I mentioned I am a Reiki Therapist also which has had a huge impact on the psychic development and connection to Spirit.  I also have a blue belt in Tae Kwon Do which is also good for grounding.  ","question6":" I focus on positive energy.  My readings are intended to uplift.  When you have read for people for such a long time as a reader I have witnessed every type of scenario and I am not here to judge but to help.  I am here to guide and pass on information.  Some information may make them emotional; a laugh or a tear but we are human and a reading can touch our souls.  Information I pass on is only for guidance and we have free will to follow that.  Although some things are pre-destined we still can alter our life paths in a positive manner.  Therefore it may be an emotional journey which will lead to breakthrough and a releasing of negative energy.  Its all good. "},{"id":2240,"display_name":"Willow S","pin":4126,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/9hyC1483453191-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"tarot, spirit guides","personal_story":"Hi everyone my name is Willow and I am a psychic energy reader. I have worked professionally for over 16 years and I come from a background of psychics from my mother's side. I am a professional Holistic Consultant and I can offer a client a reading that will leave them with clarity and choices. My aim is to channel and provide messages from spirit to help each client take positive steps forwards regardless of their situation. I enjoy speaking to people and believe that I can learn just as much from the client as they can from me during the telephone energy exchange. A phone call with me will provide a client with support, insight into their current and future situations,understanding and an open heart, together with the help of spirit, we can always find our way into a positive future. I look forward to hearing from you.","question1":"I really do enjoy reading for clients and helping them on their pathway through life. What makes me enjoy reading for clients even more so is the fact that I offer each client the unique tools they need to assist themselves to a happier future. It is so fulfilling to see clients progress and I enjoy uplifting and empowering clients to choose the best pathway for them. ","question2":"I would actually say I am not typical of my star sign at all! I am a scorpio but I am very calm, mild mannered and not vengeful or fiery. I have a very peaceful and caring nature.","question3":"From when I  was a young child, I could see, hear and sense spirit and often predicted future events with ease and accuracy too. I closed my gifts off for a good few years due to fear however in my late teens I opened myself back up to spirit and have never looked back since. ","question4":"I read for a man who believed his relationship was over and that there was no future for him at all. I reassured him that not only would he be in a happy relationship again but that his work would take off and everything would fall into place. I received a phone call again almost a year later  where he told me that everything I said came in the order I originally had given and in the exact months I gave too! He was so happy to be in a loving relationship again and told me he was taking his work to an international level. He also stated that the tools and tips I gave him helped him find his vibrational alignment which then led to the events unfolding. I was so happy he found his happy ending. ","question5":"I am a Holistic Consultant and hold qualifications in Colour Crystal Therapy, Nutrition, Massage therapist, Naturopathic Health and I am a Reiki Master Teacher. I also work and teach at a local charity and teach at workshops too. These experiences and qualifications mean I can offer a client a holistic reading helping them improve the different areas of their life in different ways. ","question6":"I believe that a client would benefit from the fact of knowing that readings are not set in stone and that everything is energy basically meaning that a reading is the strongest energy pathway for them at that time. Should they decide to go in another direction, the reading could well change too so I always ask clients to have an open heart and bear in mind that the information given is guidance and that personal responsibility should not be waived.  "},{"id":2309,"display_name":"Matthew J","pin":6003,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/2pIL1495807094-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Psychic, Clairvoyant, Intuitive Tarot reader","personal_story":"I am Clairvoyant and read the Tarot cards intuitively, i combine both my Tarot expertise and my spirit guide in readings. I have been reading for clients for many years, and work full time as a Professional Psychic Tarot reader. I aim to provide you with insight and guidance on any area or subject. I specialise in relationship analysis and Career paths. I am able to provide you with validations and spiritual guidance. I work with my guides throughout readings, and i am clairaudient, clairsentient and clairvoyant. I sense, feel hear and sometimes see a picture that i will describe to you. I begin with connecting with you, and am happy for you to ask your questions, or to begin with a general reading. Tarot responds to questions, and so if you do have any burning questions, please do ask me! My reading style is honest, compassionate and detailed. I look forward to reading for you.  ","question1":"I enjoy exploring all avenues for clients, i trust my guides and experience of tarot to give you the best guidance that i can offer. The tarot allows me to problem solve, to investigate, and this i thoroughly enjoy. My aim is to provide you with clarity and direction, to uplift you and see a way forwards. If you have any questions, the more the merrier!","question2":"I am Scorpio cusp Libra, i am passionate about life and seek to know the truth, typical of Scorpio. I am also determined and dont give up too easily, can sometimes be a good thing or a bad thing, depending on the situation. I relate to my moon sign, Taurus in many ways, i feel it describes me as a person to a tea. ","question3":"I remember when i was in my teenage years, when i firstly started to sense spirit, it seemed to happen rather quickly. I decided to purchase my first Tarot deck at 14, this helped ground me, and this was the beginning of my Journey as a reader. In my later twenties i decided to leave mainstream work to follow my love of reading for people, i have never looked back since. ","question4":"There have been many clients over the years, and many memorable experiences. I have repeat clients that tell me that i am accurate with timing, and specific events. Feedback is always appreciated. I had a client recently call me back, simply to thank me for predicting that she would get the position of Assistant Head, even though she doubted herself. I remember a client many years back a divorced lady,i predicted that she would marry the Best man at her wedding...and she did! Of course there are times where i have predicted a change in a relationship, job or both, and the change may not be so welcome at the time, however i have had feedback from clients, telling me how happy they are since making these life changing decisions.  ","question5":"i feel that my personal experiences and lessons that i have learned along the way enrich my readings. I do find that people i read for have either similar experiences or are going through what i have previously experienced.I feel that spirit \"match\" me to the client.  I have lived in Spain, Jersey, Bournemouth, Gran Canaria and now back to my roots in South Wales. I was introduced to a Tarot reader many years ago and she has been a great source of inspiration and learning to me, she helped me to ground my readings. ","question6":"Be open minded to the information that i am sharing with you, even if at the time it does not make sense. Please ask me if you are not sure. Readings quite often will not tell you what you want to hear, rather, what you need to think about. Keep an open mind when you have a reading. If you have specific questions on your mind, i am happy to answer them for you. Make a list of questions before your reading. Readings are not set in stone either, outcomes can be changed. It is always good to ask open questions, spirit dont often like to answer a simple yes or no, although the answer they give should help you to come to a conclusion. I am non judgemental and i want to help you, no question is a silly question! I look forward to hearing from you. "},{"id":2319,"display_name":"Char","pin":4010,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/L5WF1526891085-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Psychic, tarot cards ","personal_story":"Hi I'm charlotte, \r\ni have been working with tarot cards for many years and also using my psychic abilities since I was 20. \r\nI am here to help with love, money, career and relationships. I also I am a level1&2 rekik  healer and  I like to think this also helps with my reading abilities. \r\nI enjoy helping with any problem and will always come from light and love and try to help you move forward with light and love, I do believe we are all here to help one another in all aspects in life. \r\nPlease let me know if you would  like me to help with a certain situation or questions that will help you move forward with love and light. ","question1":"I love to help you move forward in a more positive way and also help you feel more clear and more confident moving forward. For me helping someone is more rewarding and natural than anything other in life. ","question2":"Ian a very typical scorpion, I come from a place of love, passion and strength with a strong insight into moving forward in a positive way and hoping building way that's best for you. Very supportive. ","question3":"I was first swear of my gift when I was 7. ","question4":"My first memorable gift was distance healing, I was in utter shock how strong of a connection I made. Absolutely blown away with the power of healing. ","question5":"Seichem 1 and 2 rekik 1 and 2 ","question6":"That they are open to receiving what ever the cards feel they want us to know, which might not be what we would like to know. "},{"id":2317,"display_name":"Bernicia","pin":4006,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/Vzuj1499094395-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Spiritual Medium, Psychic, Tarot reader, Crystal reader","personal_story":"Hello, I'm Bernicia. Thank you for visiting my profile. I have been a Spiritual Medium and Psychic for many years. I work with all the Clair's sight, smell, hearing, taste. My guides help me to give accurate information and direction in your reading. I can work with tarot cards and crystals to bring further information to the reading.   ","question1":"Its so good to empower someone so they know that they can change the course of their destination. By lifting the fog and bringing clarity to the situation, it enables you to make the decision on the best way forward. For me that's what's it's all about, helping to guide others and giving them choices. So that you feel confident and comfortable on which direction you decide to go.  ","question2":"I am in between Virgo and Libra. By having having these two traits, it helps me to put my feet on all sides of the arguments. It also helps me to bring balance to the reading and also clarity to the situation.  ","question3":"I was born with this gift, as I always felt as a child that I was different. I did not understand this until later on in life. I was always interested in star signs and tarot cards. I brought a clear quartz crystal and later that night I had a dream. In this dream I was told that I was a medium and this is the path that I should follow. Wow, at that point I did not know what a medium was back then. I went to have a reading, where I was told that I could become a reader as well. I was then guided to go to a spiritualist church and the rest is history.   ","question4":"I gave a reading to gentleman, who wanted to connect with his father who had passed to the spirit word. I brought through his next door neighbour and his father gave his son information regarding a conversation that they had about letting his son know he was safe on the other side. The son was so shocked that his father had given him evidence that he was okay. It gave the son comfort knowing that his dad is there for him and the family. ","question5":"Having my own life experience's as well as sitting in a circle and developing my mediumship, doing platform work in different in churches. I also qualified as a mentor as well. With all these qualities has enable me to empathize what people go through in life and being none judgemental. ","question6":"Trust your own inner knowing, that you will find the reader who will be able to guide you in the right direction. Also having a relaxed approach will help you and the reader bring more information. Focus on what it is that you want answered. Always be open to the response as you may not be aware of everything that's going on around you. Enjoy your reading, where you should come away feeling positive and informed. "},{"id":2322,"display_name":"Rosa","pin":4020,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/a7IC1519912120-120-120.jpg","status":"Available","favourite_story":"","favourite_story_approved":0,"callendtime":"2018-10-15 15:30:00","description":"Clairvoyant Medium Tarot and Angel Cards","personal_story":"I am Rosa a third generation psychic medium who specialises in love and career type questions. \r\nMy gift is here to help heal and guide. My gift used tarot and angel card as well as a direct link to the spiritual world","question1":"I love connecting to the Spiritual world and love meeting new people. \r\nMy gift is here to help. I am here to help you on your pathway of life. ","question2":"I am a typical cancer. Soft heart open honest and kind. I look forward to reading for you all","question3":"i am lucky to be aware and coming from a psychic family so I have been encouraged with my gift. My earliest memory was being spiritual at the early age of eight","question4":"I remember be impressed to ring a client to tell her to cancel her Xmas shopping g trip to Bath in the U.K. \r\nShe listen and telephoned me the following day to say that the bus had been involved in a accident and overturned. She was lucky because if this had happened with her in the bus she would have missed her daughters wedding.","question5":"i have vast experience within local government and health. I am a mother and a wife and I am finely tuned to the Afterlife and the psychic energies to help you. ","question6":"It is vital to remain calm and allow the spiritual energies to flow. It's about you the client and the Spirits will want a clear channel to impart the information. I am very good and connect to all aspects of your life"},{"id":2325,"display_name":"Dee","pin":4024,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/HZbK1502200272-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Clairvoyant Spiritual Medium","personal_story":"Hi I have been a practicing  medium for the last 15 years working with all my senses  including psychic intuition to give healing and messages from love ones.  I have always had the gift to communicate with the spirit world from a young age given taking after my grand father.\r\nI kept it my secret until 15 years a go I could no long hold back and resist my calling. \r\n ","question1":"I love passing the evidence, healing and sharing the memories and their messages of those that are no longer here, the energy and happiness  it gives the recipient, closure.  \r\nThere is no time in the spirit world and when they come through either hours or years after they have past, I am always amazed. I am a selfless person who pass; on these messages to help others.","question2":"I am Leo and can say that I can be passionate abut my career and will  put the time in to achieve my goal, I look after my hair is my pride and joy.  I am straight talking and fair, genuine, passionate and enthusiastic. \r\n ","question3":"I first fully became aware of my gift that I remember was when I was 9 years old I got a sense that something bad was going to happen, there was a high pitched ringing in my ears than someone talking to me to stop my friends from riding her bike but she took no notice. My friend hit the lamp post cutting open her head open.\r\nWhen I was 13 years old I woke up to visions of my great aunt in bed before she died, while at my aunts house baby sitting  answering the phone giving everyone everyone funeral arrangements. My great aunt walked down the stairs past me to the kitchen.","question4":"Over the years there have been a lot but the most memorable message I gave was to church colleague who was having a number of issues which I was not aware of had some terrible news from Ireland but came out that evening any way. While we were in the open circle 8pm I gave her a details message from her brother there was a lot of emotion from the recipient. She later  told me that here brother had passed away at 3pm that day,  part of the message was the other half of the conversation they had that morning. ","question5":"You have responsible and take pride in your work to give messages with compassion, respect and truth.  Working with the spirit world, it is an honour to be chosen for them to work with you to relay their messages to their loved ones. \r\nI am a accredited medium taught by the Spiritualist National Union disciplines. Also attended other training course run by well known mediums to give my skills a balanced standard.  ","question6":"Keep and open mind of those in the spirit world  those who come around can be family friends relations of those you are friends with, people you may have worked with, neighbours the list is end less so don't just wait for the one to come thought.\r\nRelax you will not receive bad news, it is a connection of souls, remembering and sharing of memories, giving you evidence that they are with you each and every day within their message."},{"id":2368,"display_name":"Spirit","pin":4096,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/56RC1504017757-120-120.jpg","status":"Available","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Tarot Cards, physic intuition and student medium","personal_story":"Hello everyone, I am Spirit. I have had a love for Tarot, Mediums and Physics for over 25 years. I have been reading Tarot for quite some time and also use physic intuition. The cards give you good insight and i trust in my cards to guide me through the right path. ","question1":"When people come for readings, they are often very inquisitive some are a little afraid of the unknown. After doing their readings they seem to have their sparkle back and some are quite fascinated. Trust and faith is my biggest goal.","question2":"I am very independent, strong willed and generous. When i make friends, they are friends for life. The downside to being an Aries is that i am very impatient, i want things done yesterday! I can also be a little moody from time to time.","question3":"I've always believed i've had a gift but it hasn't come easy, i've had to work hard to get to where i am and i am still working hard on Mediumship skills. If you want something, you need to work at it to achieve your goal.","question4":"My most memorable experience with a client is having a client come to me and ask if she could learn Tarot as she had chosen the wrong path in life. I won't disclose what path she had taken but she was a very lost young soul. I actually gave her a set of cards and she joined a Tarot class and i bump into her from time to time and she is unrecognisable from the person that came to my home for a reading. It puts a smile on my face every time she tells me she's on the right path now.","question5":"I am a very loving and caring person that would never judge anyone. My life experiences have taught me a lot. I get knocked down and i come back fighting, time and time again. Before i chose Tarot as my path, i had a very busy, demanding and stressful job that i absolutely loved but i was struck down with a crippling illness and thought i'd lost my purpose in life but then i found Tarot and it changed everything. I give guidance and insight to the individual person i am reading for.","question6":"It's important to be open minded and never be afraid to ask question as with some of the guidance given you may need time to digest or take it away and ask family members. Remember, we are not here to judge you, we are here to give guidance and comfort."},{"id":2390,"display_name":"Pat","pin":4129,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/lgrQ1505387903-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"tarot ryderswaite packm","personal_story":"I have had an interest in tarot for over thirty years and have been doing readings for over 20 years. i am a very chatty and friendly person and love talking to people and helping them.","question1":"Talking to people from different backgrounds and trying to help them with their problems.","question2":"I dont think i am a typical Aries as they are prone to be hot tempered people and i am very calm and dont loose my temper easily.","question3":"it was in 1979 when a friend did me a reading, and i so interested i started reading about it and got more and more interested.","question4":"my most memorable experience is when i did a friends reading a year ago. She was so grateful and humble towards me which gave me so much confidence,and a lot of pleasure.","question5":"i do have a great interest in the afterlife and past life regression, and i have had supernatural experiences too, which helps me with my readings.","question6":"That they should never ever worry about what their readings say as it is only a warning and a guidance of what could happen and will only happen if the client lets it happen."},{"id":2574,"display_name":"Tara Page","pin":4329,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/lA271516181943-120-120.jpg","status":"Available","favourite_story":"","favourite_story_approved":0,"callendtime":"2018-10-15 15:30:00","description":"Tarot cards psychic white which ","personal_story":"Hello my Name is Tara ","question1":"I like giving my client understanding honestly patients truth  ","question2":"I'm very patient loyal kind and very honest.","question3":"I was aware since childhood of my ability as I could see thing before they happen and feel thing as I got older it become Stronger and stronger then  I could pick up a pack of tarot card and read then to people and help them . ","question4":"Wen they asked me to read there  cards at that point they had there doubts they were happy with the reading but still in doubts then one day a few month later sitting  at home received a phone call  from that person she was in shock  everything I had read came she was so thankful .  ","question5":"I Have well over 20 years experience in the tarot cards and over 20 years as a psychic plus the same as a white which .      ","question6":"Not to worry ore be afraid I'm hear to help ore  advice my clients .  "},{"id":2595,"display_name":"Cats Tarot","pin":4360,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/QSVC1533016955-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"tarot cards","personal_story":"Hi my name is Cat,  I've had my own spiritual intuition for many years but never acted on it until last year. I've always had a passion for tarot & mediumship and now i feel i'd like to give something back, i've been on my own personal journey and have so much understanding & insight than i ever had before","question1":"I like to help people, i believe its about giving comfort and advice, compassion when in times of need, there is nothing nicer than hearing hope in someones voice ","question2":"i think i am true to my sign in many ways, i'm consistant, bubbly, am driven and very focused on my goals, i also love to meet new people along my journey","question3":"10 years ago i was told i had the ability and skills to read tarot but being a busy mum i didn't follow it up, but always kept it in mind, 2 years ago i was again told the same thing, and again last year, which is when i started my journey ","question4":"My most memorable experience was reading for a lady i'd never met who was a non believer, she was rather nervous but also very sceptical, As i began to read for her, her face changed to one of amazement,  by the time i came to the end of her reading she asked me if i'd been secrectly living in her cupboard as apparently i knew her better than she knew herself, was a loving reading for a very lovely lady, needless to say she in now a believer, i feel honoured i could help her to achieve this ","question5":"I have completed many successful readings face to face, for family, friends & complete strangers, i've had 100% feedback each and everytime, and i feel i have the neccessary experiance to help with any guidance needed ","question6":"Always keep an open mind & remember that you have the free will & ability to change your destiny at any time, it can only be changed by your choices, a reading is for guidance and clarity only"},{"id":2616,"display_name":"Sandy","pin":4395,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/7n3Y1520499131-120-120.jpg","status":"Busy","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Mediumship, clairvoyant, tarot, crystal, angel cards and rune stone","personal_story":"Hi my name's Denise, I like to be called 'Dee'.\r\nI'm 53 years of age, mixed race, sensitive female. I'm married, a mother to two daughters, grandma to 3 gorgeous boys and have a lovely black cat. ","question1":"The thing i  like most about giving readings to clients, is to see the awareness that encompasses them. Being able to make a person feel better and not alone is such a rewarding job to be able to do. I'm a peoples person, a humanitarian and believe that is why  i am here, today.","question2":"Being Aquarius, is a perfect sign fitting to my character; I'm always into today, yesterday and tomorrow; often at the same time. It is the dawning of Aquarius and it is also the 11th sign of the zodiac. 11 is my favourite number.\r\nAlways wanting to learn, only the things that are fitting to me mostly,  that are relevant to the path that i walk.","question3":"I am now aware that i had the gift as a child, but, my real confirmation was when I went to buy a car.  After sealing the deal, drinking a coffee with the car salesman, he suddenly turned to me and said;\r\n\"No one can pronounce my mother's name; no one!\"\r\n\"EH?\" I said a tad confused. He went on to say i'd called his mother's name out to him twice; I never heard it, i was only buying a car.\r\n\"I asked him his mother's name; sure enough i'd never heard it before he told me and i certainly couldn't repeat it for you if you asked me to.","question4":"My most memorable experience with a client was the time i was reading for a psychic team in the pubs and clubs. I was about to deliver to a middle aged, possibly retired gentleman.\r\nUnbeknown to me I'd earlier in the night read for his wife who was very open and receptive. However he was different.\r\nI gave him the understanding that if we didn't connect within ten minutes, then he didn't have to pay, or, he could sit with another reader.\r\nWithin three minutes i told him he was getting his money back and to not see anyone else.\r\n\"I've been 7 times for readings n i neva get owt!\" He said.\r\nLater that evening as i was outside taking a break i noticed the man leave the pub and head towards his car in the car park. He was with the lady mentioned earlier. She turned to me and walked over, she gave me a hug and said; \"I thought you wa gud luv, even if he didn't!\"\r\nI looked at him and said;\"Sorry Sir!\" Flip I shocked myself, i sounded as though i was 'Oliver' (Please sir can i have some more!\")\r\nHe turned to me as i'd informed him that he'd come with something too close to his heart.\r\n\"No i haven't.\"\r\n\"Yes you have!\" His wife commented. \"He's come for his aunt who passed when he was a child.\"\r\nI looked him in his eyes and said; !Why when your wife just mentioned your aunt did spirit put a large pair of scissors in front of your face?\"\r\nHe burst into floods of tears and walked out of the car park, his wife cried after him;\r\n\"I told you, I told you!\" She called all excitedly.\r\nShe hugged me again, at least three times, thanking me all the while. She explained the 'link' given, which was very personal, too personal for mentioning here on a public sight. He had the best reading ever, he didn't pay, got told not to have another, and he got what he came for. He could now relax and enjoy his days.","question5":"I hold a basic counselling certificate which helps in my empathic delivery to a client , friend or co-worker. I am usually the 'voice' for my work colleagues, in my local council job. I am also a published author of the; 'Fools Journey, Weak as Hell', with three others in the pipe line.\r\nI am full of life experience in almost all aspects of life, which in turn feeds my empathy and understanding to a peak.\r\nI've worked the psychic field for quite some time now, almost 9 years in total, although it's been by my side most of my life.","question6":"The first thing a person needs to consider before they have a psychic reading is to ask themselves why they want one.\r\nFantastic for a general reading but for something a little closer to home may take a few visits to differing readers, just to be given the best opportunity for connection, as we all work differently and use different tools.\r\nSome readers are more sensitive than others to spirit, some are less sensitive in their delivery and some are just 'Billy Bull sh......' "},{"id":2621,"display_name":"Sagitta","pin":4402,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/Y1AB1519383831-120-120.jpg","status":"Available","favourite_story":"","favourite_story_approved":0,"callendtime":"2018-10-15 15:30:00","description":"Tarot cards, angel tarot cards, angel oracle answer cards, pendulum, crystal runes","personal_story":"Hello , I am Sagitta, an intuitive professional tarot reader and Reiki practitioner.  In my readings I use my intuition, I work with my spirit guides, a pendulum, and crystal runes. I am honest, sensitive and emphatic, down to earth,non judgemental, I will never give you false assurance. In my readings, I am looking to connect with your energy and your state of mind, in form of a smooth open, informative interaction. You will get my honest answer , along with a discerning mind, good old fashioned communication, and common sense. I approach every reading with an open heart, absolutely no judgement, will be willing to walk you through a mutually  satisfying journey of energy and conversation. I am and empath  , which means I am able to connect with your emotional state , that enables me to feel your unique energy . Remember nothing is cast in stone, you are the architect of your life.","question1":"I am here for you to do my best to help you in any way I can , no matter how big or small your problem is, by the end of the reading you to have more clarity and insight in which direction you would want to take in your life. Every reading I give it tells me something about myself, Tarot is a source of inspiration for me. Tarot thought me to trust my senses, without any shadow of a doubt, it helped me to help others find the way  when the path wasn’t clear, it helped my clients and myself to see where exactly we are, It empowered us. I actually take great pleasure in opening people up for the possibilities that Tarot can offer. ","question2":"I am a typical Capricorn, Earth sign, Saturn is my ruling planet. \r\nI am all about hard work, professional and traditional, ambitious, determined, practical taking one step after another( this helps me unfold a good reading), patient, being as realistic as possible ( always deliver an honest reading), efficient and organised. ","question3":"Perhaps like many of us, most of my childhood it was filled with unexplained and weird happenings ( I call them flash backs, is when I can see people I don’t even know yet or family members , friends, in future situations, all lasts only for a few seconds, and when it’s actually happening I know I knew saw  that coming)  What  does this mean?  What should I do?” No one seemed to give me a clear answer, until one day I discovered the Tarot. Once I found the cards I was totally fascinated and I couldn’t put them down. Indeed I felt I found a key to a door.  It was if Tarot expanded my understanding of life and the Universe, but most of all the cards provide me a frame of work and basis for my intuition. ","question4":"I have good memories and I am   grateful when    clients get back to me being in a better place in their life, being happier ,when I know I was able to help them overcome obstacles in their life. \r\n ","question5":"Reiki practitioner 1&2 \r\nCrystal runes\r\nAstrology birth charts","question6":"People look for a reading , in times of uncertainty and trouble. Tarot is about helping  the client write their future one line at a time, Tarot is a guidance tool and a Consuelo get aid, and can empower people to make their own decisions , rather than simply telling them what will happen. \r\nI think is important the client to be open minded and open hearted , trust the reader, as the reader is a messenger and an interpreter of the message from the cards. "},{"id":2716,"display_name":"Misty Tee","pin":4563,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/39P31524749468-120-120.jpg","status":"Available","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Tarot cards, Clairvoyantly, Ribbons, Angel Cards.","personal_story":"I am naturally psychic and have been on my spiritual development path for many years now. I am called to use my psychic gifts for the benefit of others, as I believe it is my calling to do so. I have given thousands of reading to people all over the world and read with honesty and kindness, this has helped me to build up my excellent reputation as a reliable reader.\r\n \r\n ","question1":"I enjoy connecting with callers and really admire and respect their honesty and trust put in me as a reader.  I read empathically which means I take on the emotions of the caller during the call and this allows a strong connection to build, this let’s me get to the heart of what’s going on and to use my connection to spirit as well as my counselling skills to bring peace and clarity- this for me is why I job I do.\r\nI enjoy being on the same level as callers and we have shared many laughs over the years, when it is appropriate to do so. I always use my high level of sensitivity to know how to best approach each caller, as we are all individuals and one size certainly does not fit all.\r\nAs many people, I have not had a straight forward journey through this life and have developed many skills along the way which have been invaluable when understanding people from all walks of life. I will signpost callers to practical help when and if this seems appropriate. I understand as a reader I must stay grounded and protected and will psychically relay this kind of knowledge to callers when needed. ","question2":"Being a Gemini, and having my moon as well as my sun in Gemini- this makes my life varied and interesting to say the least! I am a great communicator and able to see many aspects of a situation at the same time and enjoy finding ways to deliver these message and to callers. I am a very visual person, which I see as a strength when I read as due to my Gemini adaptability I am never afraid to use visualisations in my readings to really get to the heart of whatsoever going on for the caller And to strengthen connections. \r\nAs I have powerful Taurus rising in my astrological chart I am very loyal and also grounded which balance and out my Gemini aspects perfectly- in my opinion anyway! This has lead me to gain educational knowledge about things like Tarot cards and Angels and keep s my air head in check, so my readings are steeped in practicality as well as psychic ability. \r\n ","question3":"I have always had a sense of knowing and have followed this for as long as I can remember people have always come to me for my insights and I grew up as a child, then as a young person just being used to this. I just knew things that no one else did. I now understand that as I had been through personal losses at an early age, that my loved ones who passed Over we’re looking after me from the spirit world, keeping me out of harms way. It wasn’t until my early 20’s that I started to meditate and understand that the insights I have come from my spirit guides and angels.\r\n ","question4":"Speaking with a male caller, a few years back, who had fallen out with his girlfriend as was feeling heartbroken and really very sad. I had an image In my mind of a black and white cat sitting on his pillow and knew her name to be Tinkerbell. At this the caller said this was his childhood pet who always used to sit on his pillow and wait for him, and always knew when he was feeling sad. I then tuned into this little spirit and conveyed a message to him that absolutely astounded him. He then knew what he needed to do. I sent him some healing and I felt his energy visibly lifting. This was extremely uplifting for both the caller and myself as I felt both his and my own spirit guides working through me and I knew this was my calling.","question5":"I have many years of counselling training and have worked with lots of diverse and vulnerable groups of people in my community. I have worked with homeless people, young people, adults with no formal education, women and men in domestic violence situations and substance misusers and their families. I am able to work sensitively with callers who may be in distress and not knowing where to turn, without being depleted myself. This has shown me time and time again how we all have the ability to lift our energy To put us in a better place in our heads and in our lives. I understand my job as reader is to be a channel to help callers access a better path through life that honours their soul’s purpose.\r\nI belong to a psychic development group and this makes sure I stick to the ground rules of clearings my energy in between readings, grounding myself and working within the spiritual light of protection. \r\nI am now blessed to be working as a Spiritual Life’s coach and healer, as well as a reader. ","question6":"The most important thing to consider is that when having a reading, you are connecting with your own spirit guides who really do want you to receive the messages they have for you. The reader is a channel that allows this to happen and you will come for a reading at the time you are divinely guided to Be here.\r\nFor a reader to connect with you that must connect with your energy, so the more open you are, the better the reading will be.\r\nIts Really good to have a good connection, so by just being warm and friendly towards your reader then this builds the vibrations and a great reading will follow! \r\nI will ask for confirmation that the caller can relate to what I am saying but will not ask for information, it’s is my job to give the messages to you- and a testimony that spirit is there for you. "},{"id":2719,"display_name":"Psychic Serenity ","pin":4570,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/G9nf1525352721-120-120.jpg","status":"Available","favourite_story":"","favourite_story_approved":0,"callendtime":"2018-10-15 15:30:00","description":"Tarot, Angel cards, intuitive clairvoyant, divination Biorhythm, Astrological birth charts and Numerology","personal_story":"My name is Serenity ...yes that is my real name! I am an intuitive clairvoyant empath.\r\nFirstly please know you have come to the rightperson for genuine intuitive guidance.\r\nI have been naturally guiding those seeking the truth in matters in their personal life for many years. 24+ to be exact. My grandmother was a medium and highly intuitive. I learnt my gift young and started in my early teenage years to predict and guide.\r\nI specialise in Tarot, Angel cards and Numerology. I like to include astrology into my readings to get a better perspective.\r\n \r\n \r\n ","question1":"Helping those understand the perspective of their lives is a great gift to have and it fulfills my soul to help others see their path or obstacles they may not be aware are there. \r\nNo better reward than to help others in this life.","question2":"I have a great exterior Libran personality.  I like calm and balanced environments but my roots run deep due to my ascendant.\r\nI have Virgo ascendant which keeps me grounded to the core of my very being.\r\nThis combination of air and earth helps me deliver the best intuitive guidance to those that need it ","question3":"When I was around 3, which is a powerful spiritual number, I became aware i was different and could foresee things others seemed blind too. It was slow yet powerfully progressive. By the time I was 6, another change in spiritual revelations according to numerology, I had begun practising with runes and divination with my grandmothers crystal ball.\r\nI knew what I was getting for Christmas every year! Lol","question4":"A client had had some hard times in life and to be Blessed to see nothing but prosperity and change coming into her life through so many new prospects.\r\nI was mind blown by the beauty that was due to this person. There was so much goodness due to them that I got emotional. \r\nLike I said I am an Empath and I pick up on what you feel what you have felt are feeling and the feelings to come. ","question5":"One of many courses completed is my past life transgression diploma\r\nI am a practicing shaman. I meditate on a regular daily  basis and teach yoga to a local community centre. \r\nThrough pure ancestrial teaching and natural family ties that bind I can say I am a natural.","question6":"To be open minded, honest and willing to be guided into the right direction by universal love and intuitive guidance."},{"id":2738,"display_name":"Blue Paraiba","pin":4596,"photo":"https:\/\/www.psychicsofa.com\/Images\/Readers\/qI3d1527080771-120-120.jpg","status":"Available","favourite_story":"","favourite_story_approved":0,"callendtime":"0000-00-00 00:00:00","description":"Tarot, Psychic Clairvoyant, Angel Cards, Empath","personal_story":" \r\nAs a Natural Clairvoyant who uses Tarot cards to earth her abilities. Blue Paraiba has many years of experience doing fact to face reading and telephone consultations, national and internationally. As well as her clairvoyant, clairsentient, clairaudient and claircognizant abilities, Blue Paraiba works with her own spirit guides. Blue Paraiba finds the Tarot cards, at the start of a reading, and can then cut quickly through the psychic fog, and act as a bridge across forever upon which she can better build the connection for answers to come.","question1":"I enjoy listen to people, and a good motivator where I genuinely like to help people.  I am genuinely interested in people and find that I like to work with my guides to help people to guide them back onto the right path. I have made many predictions about important events in my life and these have now come to pass. I like to use my insight to provide people with a lot of comfort and to provide clarity when dealing with life’s challenges.","question2":"As a Pisces I am very friendly, and often find myself in the company of very different people. I would like to say as a Pisces, I am selfless, and always willing to help others, without hoping to get anything back. Pisces is a Water sign and as such this zodiac sign is characterized by empathy and expressed emotional capacity.","question3":"When growing up, I always felt different from other people I would become sensitive to people needs and found that I wanted to find various ways to help them. Having been born into a family of female psychics, I have spent most of my time being brought up with a good understanding of the spirit world, and and have been visited many times by spirits wanting to come through.","question4":"I have many memorable experiences with clients and it is difficult to pinpoint one particular reading. All I know is that I enjoy assisting and helping people to overcome their fears and obstacles in life, and I like to work with my guides to help them to put them back on the right path. I like to work with people to release their negativity and help them to feel more positive after a reading. ","question5":"I have 20 years’ experience in psychic reading and use my spirit guides and the tarot cards to provide insightful and accurate readings.  I have four master’s degrees, and I am now in the process of completing my Educational Doctorate.","question6":"In preparation for having a reading, it is important to learn to relax and have an open mind. It is also important to choose a reader that you feel drawn to and have a good connection with."}]
